# MicrometersPerMeterDegreeCelsius Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..MicrometersPerMeterDegreeCelsius Property
UnitTypeId Class See Also
---
Micrometers per meter degree Celsius.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId MicrometersPerMeterDegreeCelsius { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MicrometersPerMeterDegreeCelsius As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MicrometersPerMeterDegreeCelsius {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace